In [1]:
import pandas as pd

In [4]:
s1 = pd.Series([0,1,2,3,4,5])
print(s1)

s2 = pd.Series({0: 'boo', 1: 'foo', 2: 'woo'})
print(s2)

0    0
1    1
2    2
3    3
4    4
5    5
dtype: int64
0    boo
1    foo
2    woo
dtype: object

In [6]:
d1 = pd.DataFrame([[0, 1, 2], [3, 4, 5], [6, 7,8], [9, 10, 11]], index=[10, 11, 12, 13])
print(d1)
d2 = pd.DataFrame({'initial': ['B', 'F,', 'W'], 'Name': ['boo', 'foo', 'woo']})
print(d2)

    0   1   2
10  0   1   2
11  3   4   5
12  6   7   8
13  9  10  11
  initial Name
0       B  boo
1      F,  foo
2       W  woo

In [12]:
df = pd.read_csv('simple_score.csv')

df.head(3)

   user   kokugo   shakai   sugaku   rika
0     1       30       43       51     63
1     2       39       21       49     56
2     3       29       30       23     57

In [8]:
print(df.index)
len(df.index)

RangeIndex(start=0, stop=5, step=1)

5

In [9]:
df[:3]

   user   kokugo   shakai   sugaku   rika
0     1       30       43       51     63
1     2       39       21       49     56
2     3       29       30       23     57

In [10]:
df[-2:]

   user   kokugo   shakai   sugaku   rika
3     4       95       87       77    100
4     5       70       71       78     67

In [18]:
df[' sugaku'].head(3)

0    51
1    49
2    23
Name:  sugaku, dtype: int64

In [19]:
df[['user', ' sugaku']].head(3)

   user   sugaku
0     1       51
1     2       49
2     3       23